#pragma once
#include <SFML\Graphics.hpp>
#include "level_1.h"

//Это точки старта, поворота и конца
float path[points][2] = {
	//Это старт
	{0, 1.5f * 64},
	{5.5f * 64, 1.5f * 64},
	{5.5f * 64, 11.5f * 64},
	{23.5f * 64, 11.5f * 64},
	{23.5f * 64, 18.5f * 64},
	//Это база
	{39.5f * 64, 18.5f * 64}

	//Это движение по кругу, чтобы проверить поворот спрайта
	//{0, 1.5f * 64},
	//{5.5f * 64, 1.5f * 64},
	//{5.5f * 64, 4.5f * 64},
	//{10.5f * 64, 4.5f * 64},
	//{10.5f * 64, 1.5f * 64},
	////Это база
	//{5.5f * 64, 1.5f * 64}

	
};

//Сама карта
sf::String TileMap[HEIGHT_MAP] = {
	"                                        ",
	"shhhh1                                  ",
	"     v                                  ",
	"     v                                  ",
	"     v                                  ",
	"     v                                  ",
	"     v                                  ",
	"     v                                  ",
	"     v                                  ",
	"     v                                  ",
	"     v                                  ",
	"     3hhhhhhhhhhhhhhhhh1                ",
	"                       v                ",
	"                       v                ",
	"                       v                ",
	"                       v                ",
	"                       v                ",
	"                       v                ",
	"                       3hhhhhhhhhhhhhhhf",
	"                                        ",
	"                                        ",
	"                                        ",
	"                                        ",
	"                                        ",
	"                                        ",
};

//пробел - трава
//символ s - стартовая клетка
//символ h - горизонтальная дорога
//символ v - вертикальная дорога
//символ 1 - слева вниз
//символ 2 - справа вниз
//символ 3 - сверху вправо
//символ 4 - сверху влево
//символ f - база, финиш